# TotalByAssemblyType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleField..::..TotalByAssemblyType Property
ScheduleField Class See Also
---
In an assembly schedule view, indicates if totals are calculated for all assembly instances of the same type or only for a single instance.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool TotalByAssemblyType { get; set; }
```

Visual Basic
---
```text
Public Property TotalByAssemblyType As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool TotalByAssemblyType {
	bool get ();
	void set (bool value);
}
```

# ### Field Value
True if totals are calculated for all assembly instances. False if totals are calculated for one instance.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: This ScheduleField cannot be totaled by assembly type. -or- When setting this property: Totals are not enabled for this ScheduleField. |

# See Also
ScheduleField Class
Autodesk.Revit.DB Namespace